source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/CaxiasDoSulRS.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<EnviarLoteNotas versao="1.00">
			<Descricao>Enviar Lote Notas</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>envioLote</TagAssinatura>
			<TagAtributoID>NFS-e</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:enviarLoteNotas><xml>{xmlBody}</xml></ws:enviarLoteNotas></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</EnviarLoteNotas>
		<CancelarNotaFiscal versao="1.00">
			<Descricao>Cancelamento Nota Fiscal</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedCancelaNFSe</TagAssinatura>
			<TagAtributoID>CNPJ</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:cancelarNotaFiscal><xml>{xmlBody}</xml></ws:cancelarNotaFiscal></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</CancelarNotaFiscal>
		<ConsultarNotaFiscal versao="1.00">
			<Descricao>Consultar Nota Fiscal</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedConsultaTrans</TagAssinatura>
			<TagAtributoID>CNPJ</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:consultarNotaFiscal><xml>{xmlBody}</xml></ws:consultarNotaFiscal></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</ConsultarNotaFiscal>
		<ObterCriticaLote versao="1.00">
			<Descricao>Consulta Pedido Status Lote</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedidoStatusLote</TagAssinatura>
			<TagAtributoID>CNPJ</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:obterCriticaLote><xml>{xmlBody}</xml></ws:obterCriticaLote></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</ObterCriticaLote>
		<ObterNotaFiscalXml versao="1.00">
			<Descricao>Obter Nota Fiscal Xml</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedidoNFSe</TagAssinatura>
			<TagAtributoID>CNPJ</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:obterNotaFiscalXml><xml>{xmlBody}</xml></ws:obterNotaFiscalXml></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</ObterNotaFiscalXml>
		<ConsultarNfsePDF versao="1.00">
			<Descricao>Obter Nota Fiscal Xml</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>pedidoNFSePDF</TagAssinatura>
			<TagAtributoID>CNPJ</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:obterNotasEmPDF><xml>{xmlBody}</xml></ws:obterNotasEmPDF></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</ConsultarNfsePDF>
		<SolicitacaoInutilizacao versao="1.00">
			<Descricao>Solicitar Inutilizacao NFSe</Descricao>
			<WebEnderecoHomologacao>https://nfsehomol.caxias.rs.gov.br/portal/Servicos?wsdl</WebEnderecoHomologacao>
			<WebEnderecoProducao>https://nfse.caxias.rs.gov.br/portal/Servicos?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<TagAssinatura>solicitacaoInutilizacao</TagAssinatura>
			<TagAtributoID>numeroSolicitacao</TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapStringHomologacao><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:inutilizacao><xml>{xmlBodyScapeRetorno}</xml></ws:inutilizacao></soapenv:Body></soapenv:Envelope>]]></WebSoapStringHomologacao>
			<WebSoapStringProducao><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.pc.gif.com.br/"><soapenv:Header/><soapenv:Body><ws:inutilizacao><xml>{xmlBodyScapeRetorno}</xml></ws:inutilizacao></soapenv:Body></soapenv:Envelope>]]></WebSoapStringProducao>
			<WebTagRetorno>prop:innertext</WebTagRetorno>
			<WebEncodingRetorno>UTF-8</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS>http://ws.pc.gif.com.br/</TargetNS>
		</SolicitacaoInutilizacao>
	</Servicos>
</Configuracoes>